Ran Plan for dir: `terraform/live/mecsys/production/open-x/horto-city/open-x/consent` workspace: `terraform_live_mecsys_production_open-x_horto-city_open-x_consent`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.combined[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "combined" {
+       id                      = (known after apply)
+       json                    = (known after apply)
+       minified_json           = (known after apply)
+       source_policy_documents = (known after apply)
    }

  # data.aws_iam_policy_document.deny_insecure_transport[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "deny_insecure_transport" {
+       id            = (known after apply)
+       json          = (known after apply)
+       minified_json = (known after apply)

+       statement {
+           actions   = [
+               "s3:*",
            ]
+           effect    = "Deny"
+           resources = [
+               (known after apply),
+               (known after apply),
            ]
+           sid       = "denyInsecureTransport"

+           condition {
+               test     = "Bool"
+               values   = [
+                   "false",
                ]
+               variable = "aws:SecureTransport"
            }

+           principals {
+               identifiers = [
+                   "*",
                ]
+               type        = "*"
            }
        }
    }

  # aws_s3_bucket.this[0] must be replaced
-/+ resource "aws_s3_bucket" "this" {
+       acceleration_status         = (known after apply)
+       acl                         = (known after apply)
!       arn                         = "arn:aws:s3:::mecsys-bucket" -> (known after apply)
!       bucket                      = "mecsys-bucket" -> "mecsys-bucket-3" # forces replacement
!       bucket_domain_name          = "mecsys-bucket.s3.amazonaws.com" -> (known after apply)
+       bucket_prefix               = (known after apply)
!       bucket_regional_domain_name = "mecsys-bucket.s3.us-east-1.amazonaws.com" -> (known after apply)
!       hosted_zone_id              = "Z3AQBSTGFYJSTF" -> (known after apply)
!       id                          = "mecsys-bucket" -> (known after apply)
!       policy                      = jsonencode(
            {
-               Statement = [
-                   {
-                       Action    = "s3:*"
-                       Condition = {
-                           Bool = {
-                               "aws:SecureTransport" = "false"
                            }
                        }
-                       Effect    = "Deny"
-                       Principal = "*"
-                       Resource  = [
-                           "arn:aws:s3:::mecsys-bucket/*",
-                           "arn:aws:s3:::mecsys-bucket",
                        ]
-                       Sid       = "denyInsecureTransport"
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> (known after apply)
!       region                      = "us-east-1" -> (known after apply)
!       request_payer               = "BucketOwner" -> (known after apply)
        tags                        = {
            "Environment" = "production"
            "Scost"       = "open-x"
            "Terraform"   = "true"
        }
+       website_domain              = (known after apply)
+       website_endpoint            = (known after apply)
        # (3 unchanged attributes hidden)

-       grant {
-           id          = "7b9628a20a58219be48a785e3a9b75bac9ee90d10972e167d495de661270134e" -> null
-           permissions = [
-               "FULL_CONTROL",
            ] -> null
-           type        = "CanonicalUser" -> null
            # (1 unchanged attribute hidden)
        }

-       server_side_encryption_configuration {
-           rule {
-               bucket_key_enabled = false -> null

-               apply_server_side_encryption_by_default {
-                   sse_algorithm     = "AES256" -> null
                    # (1 unchanged attribute hidden)
                }
            }
        }

-       versioning {
-           enabled    = false -> null
-           mfa_delete = false -> null
        }
    }

  # aws_s3_bucket_policy.this[0] must be replaced
-/+ resource "aws_s3_bucket_policy" "this" {
!       bucket = "mecsys-bucket" # forces replacement -> (known after apply) # forces replacement
!       id     = "mecsys-bucket" -> (known after apply)
!       policy = jsonencode(
            {
-               Statement = [
-                   {
-                       Action    = "s3:*"
-                       Condition = {
-                           Bool = {
-                               "aws:SecureTransport" = "false"
                            }
                        }
-                       Effect    = "Deny"
-                       Principal = "*"
-                       Resource  = [
-                           "arn:aws:s3:::mecsys-bucket/*",
-                           "arn:aws:s3:::mecsys-bucket",
                        ]
-                       Sid       = "denyInsecureTransport"
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> (known after apply)
    }

  # aws_s3_bucket_public_access_block.this[0] must be replaced
-/+ resource "aws_s3_bucket_public_access_block" "this" {
!       bucket                  = "mecsys-bucket" # forces replacement -> (known after apply) # forces replacement
!       id                      = "mecsys-bucket" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_s3_bucket_server_side_encryption_configuration.this[0] must be replaced
-/+ resource "aws_s3_bucket_server_side_encryption_configuration" "this" {
!       bucket                = "mecsys-bucket" # forces replacement -> (known after apply) # forces replacement
!       id                    = "mecsys-bucket" -> (known after apply)
        # (1 unchanged attribute hidden)

-       rule {
-           bucket_key_enabled = false -> null

-           apply_server_side_encryption_by_default {
-               sse_algorithm     = "AES256" -> null
                # (1 unchanged attribute hidden)
            }
        }
+       rule {
+           apply_server_side_encryption_by_default {
+               sse_algorithm     = "AES256"
                # (1 unchanged attribute hidden)
            }
        }
    }

  # aws_s3_bucket_versioning.this[0] must be replaced
-/+ resource "aws_s3_bucket_versioning" "this" {
!       bucket                = "mecsys-bucket" # forces replacement -> (known after apply) # forces replacement
!       id                    = "mecsys-bucket" -> (known after apply)
        # (1 unchanged attribute hidden)

!       versioning_configuration {
+           mfa_delete = (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

Plan: 5 to add, 0 to change, 5 to destroy.

Changes to Outputs:
!   s3_bucket_arn                           = "arn:aws:s3:::mecsys-bucket" -> (known after apply)
!   s3_bucket_bucket_domain_name            = "mecsys-bucket.s3.amazonaws.com" -> (known after apply)
!   s3_bucket_bucket_regional_domain_name   = "mecsys-bucket.s3.us-east-1.amazonaws.com" -> (known after apply)
!   s3_bucket_hosted_zone_id                = "Z3AQBSTGFYJSTF" -> (known after apply)
!   s3_bucket_id                            = "mecsys-bucket" -> (known after apply)
!   s3_bucket_policy                        = jsonencode(
        {
-           Statement = [
-               {
-                   Action    = "s3:*"
-                   Condition = {
-                       Bool = {
-                           "aws:SecureTransport" = "false"
                        }
                    }
-                   Effect    = "Deny"
-                   Principal = "*"
-                   Resource  = [
-                       "arn:aws:s3:::mecsys-bucket/*",
-                       "arn:aws:s3:::mecsys-bucket",
                    ]
-                   Sid       = "denyInsecureTransport"
                },
            ]
-           Version   = "2012-10-17"
        }
    ) -> (known after apply)
!   s3_bucket_region                        = "us-east-1" -> (known after apply)
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d terraform/live/mecsys/production/open-x/horto-city/open-x/consent -w terraform_live_mecsys_production_open-x_horto-city_open-x_consent
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.mecsys.com.br/lock?id=mecsys%252Fmecsys-gitops%252Fterraform%252Flive%252Fmecsys%252Fproduction%252Fopen-x%252Fhorto-city%252Fopen-x%252Fconsent%252Fterraform_live_mecsys_production_open-x_horto-city_open-x_consent)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d terraform/live/mecsys/production/open-x/horto-city/open-x/consent -w terraform_live_mecsys_production_open-x_horto-city_open-x_consent
  ```
Plan: 5 to add, 0 to change, 5 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```